nix-adventures-02.org
#+BEGIN_EXPORT html
---
categories: nix
date: 2024-02-11
layout: default
title: "Nix Adventures Part 2: Machine Learning Servers"
parent: nix-adventures.org
---
#+END_EXPORT

#+title:     Nix Adventures Part 2: Machine Learning Servers
#+author:    Logan Barnett
#+email:     logustus@gmail.com
#+date:      <2024-01-19 Fri>
#+language:  en
#+file_tags:
#+tags:
#+auto_id:   t
#+toc:       headlines 3

* What is this?
:PROPERTIES:
:CUSTOM_ID: what-is-this
:END:

See [[file:./nix-adventures-01.org][Nix Adventures Part 1]] for the introduction for all of this.

* Today's adventure: Building a Suite of Machine Learning Servers
:PROPERTIES:
:CUSTOM_ID: today's-adventure:-building-a-suite-of-machine-learning-servers
:END:

I want to get a machine learning platform setup in my local network.  I love the
power of the Internet and I hate how dependent we are upon it, and the lack of
privacy and control we have as a result.  But with lots of spare time anyone can
setup their own servers with this stuff.  [[https://localai.io][LocalAI]] looks good for this.  Cool
kids can tell me if there's something better.

I want to setup LocalAI on my local network, but first I need to _build_ it.  I
know it comes with a Docker image but Docker images, in my experience, are very
frail and do not age well.  Maybe it has something to do with the =apt-get
update= or equivalent that's at the start of every image in existence.  This is
where Nix shines, fortunately, and more so with Nix Flakes.  A quick reminder:
Nix Flakes uses a =flake.lock= file which has the pinned information needed to
make a perfect copy of the constructed software under any circumstance.

