nix-adventures-02.html
---
categories: nix
date: 2024-02-11
layout: default
title: "Nix Adventures Part 2: Machine Learning Servers"
parent: nix-adventures.org
---

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#what-is-this">1. What is this?</a></li>
<li><a href="#today's-adventure:-building-a-suite-of-machine-learning-servers">2. Today&rsquo;s adventure: Building a Suite of Machine Learning Servers</a>
<ul>
<li><a href="#today's-adventure:-building-a-suite-of-machine-learning-servers--building-on-macos-localai">2.1. Building on macOS (LocalAI)</a></li>
<li><a href="#today's-adventure:-building-a-suite-of-machine-learning-servers--building-on-macos-stable-diffusion-webui">2.2. Building on macOS (stable-diffusion-webui)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-what-is-this" class="outline-2">
<h2 id="what-is-this"><span class="section-number-2">1.</span> What is this?</h2>
<div class="outline-text-2" id="text-what-is-this">
<p>
See <a href="./nix-adventures-01.html">Nix Adventures Part 1</a> for the introduction for all of this.
</p>
</div>
</div>
<div id="outline-container-today's-adventure:-building-a-suite-of-machine-learning-servers" class="outline-2">
<h2 id="today's-adventure:-building-a-suite-of-machine-learning-servers"><span class="section-number-2">2.</span> Today&rsquo;s adventure: Building a Suite of Machine Learning Servers</h2>
<div class="outline-text-2" id="text-today's-adventure:-building-a-suite-of-machine-learning-servers">
<p>
I want to get a machine learning platform setup in my local network.  I love the
power of the Internet and I hate how dependent we are upon it, and the lack of
privacy and control we have as a result.  But with lots of spare time anyone can
setup their own servers with this stuff.  <a href="https://localai.io">LocalAI</a> looks good for this.  Cool
kids can tell me if there&rsquo;s something better.
</p>

<p>
I want to setup LocalAI on my local network, but first I need to <span class="underline">build</span> it.  I
know it comes with a Docker image but Docker images, in my experience, are very
frail and do not age well.  Maybe it has something to do with the <code>apt-get
update</code> or equivalent that&rsquo;s at the start of every image in existence.  This is
where Nix shines, fortunately, and more so with Nix Flakes.  A quick reminder:
Nix Flakes uses a <code>flake.lock</code> file which has the pinned information needed to
make a perfect copy of the constructed software under any circumstance.
</p>
</div>
