nix-adventures-02.org
** Building on macOS (stable-diffusion-webui)
:PROPERTIES:
:CUSTOM_ID: today's-adventure:-building-a-suite-of-machine-learning-servers--building-on-macos-stable-diffusion-webui
:END:

Getting =stable-diffusion-webui= stood up on macOS took a total of about 5
minutes using https://github.com/virchau13/automatic1111-webui-nix.  It isn't a
pure/proper nix solution, but this is a huge start.  From this, I can imagine
automatically pulling down and configuring models from =huggingface= or whatever
we want, plus using SHA verification.

That was fun!  I can generate images on battery in about a minute.  I'm now
confronted with some choices.  I can continue to run this on my Macbook Pro (M1
Pro), or call it good and move on to making this run on NixOS, and putting it on
a dedicated server.  I have to admit that it's fun to play with on my laptop but
it will carry more utility on a dedicated server (even if that server is
slower - I don't know if it will be).  Next I will pursue the server
configuration.  I'd like to improve this derivation too.  I can imagine getting
the models automatically downloaded and consumed just by listing their names or
URLs.

This has been a very big adventure, just to switch gears.  For working with
=stable-diffusion-webui=, let's move that to the [[file:./nix-adventures-03.org][third Nix adventure]] in the
series.
