nix-adventures-02.html
<div id="outline-container-today's-adventure:-building-a-suite-of-machine-learning-servers--building-on-macos-stable-diffusion-webui" class="outline-3">
<h3 id="today's-adventure:-building-a-suite-of-machine-learning-servers--building-on-macos-stable-diffusion-webui"><span class="section-number-3">2.2.</span> Building on macOS (stable-diffusion-webui)</h3>
<div class="outline-text-3" id="text-today's-adventure:-building-a-suite-of-machine-learning-servers--building-on-macos-stable-diffusion-webui">
<p>
Getting <code>stable-diffusion-webui</code> stood up on macOS took a total of about 5
minutes using <a href="https://github.com/virchau13/automatic1111-webui-nix">https://github.com/virchau13/automatic1111-webui-nix</a>.  It isn&rsquo;t a
pure/proper nix solution, but this is a huge start.  From this, I can imagine
automatically pulling down and configuring models from <code>huggingface</code> or whatever
we want, plus using SHA verification.
</p>

<p>
That was fun!  I can generate images on battery in about a minute.  I&rsquo;m now
confronted with some choices.  I can continue to run this on my Macbook Pro (M1
Pro), or call it good and move on to making this run on NixOS, and putting it on
a dedicated server.  I have to admit that it&rsquo;s fun to play with on my laptop but
it will carry more utility on a dedicated server (even if that server is
slower - I don&rsquo;t know if it will be).  Next I will pursue the server
configuration.  I&rsquo;d like to improve this derivation too.  I can imagine getting
the models automatically downloaded and consumed just by listing their names or
URLs.
</p>

<p>
This has been a very big adventure, just to switch gears.  For working with
<code>stable-diffusion-webui</code>, let&rsquo;s move that to the <a href="./nix-adventures-03.html">third Nix adventure</a> in the
series.
</p>
</div>
</div>
</div>
